posts/times-series-neural-networks.org
#+BEGIN_COMMENT
.. title: A list of interesting Posts On ML techniques
.. slug: interesting-posts-on-ml
.. date: 2020-07-21 21:40:24 UTC+02:00
.. tags: Machine Learning
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT


This is a list of good material I found on various ML techniques. Some
you might want to explore them deeper in later posts. Some will just
stay as they are here.

{{{TEASER_END}}}

#+BEGIN_EXPORT html
<br>
<br>
#+END_EXPORT

* Neural Networks Times Series

Best explaination in the world wide web for [[https://colah.github.io/posts/2015-08-Understanding-LSTMs/][LSTM models architecture]].  

A good [[https://stanford.edu/~shervine/teaching/cs-230/cheatsheet-recurrent-neural-networks][cheat sheet on RNN.]] On the website you can find other similar
scripts for other Neural Networks Architectures.

* Support Vector Regression.

This is an interesting technique. [[https://www.mathworks.com/help/stats/understanding-support-vector-machine-regression.html][It draws on the idea of SVM]].



