cache/posts/times-series-neural-networks.html
<p>
This is a list of good material I found on various ML techniques. Some
you might want to explore them deeper in later posts. Some will just
stay as they are here.
</p>

<!-- TEASER_END -->

<br>
<br>

<div id="outline-container-org9aaf929" class="outline-2">
<h2 id="org9aaf929">Neural Networks Times Series</h2>
<div class="outline-text-2" id="text-org9aaf929">
<p>
Best explaination in the world wide web for <a href="https://colah.github.io/posts/2015-08-Understanding-LSTMs/">LSTM models architecture</a>.  
</p>

<p>
A good <a href="https://stanford.edu/~shervine/teaching/cs-230/cheatsheet-recurrent-neural-networks">cheat sheet on RNN.</a> On the website you can find other similar
scripts for other Neural Networks Architectures.
</p>
</div>
</div>

<div id="outline-container-orge37edd7" class="outline-2">
<h2 id="orge37edd7">Support Vector Regression.</h2>
<div class="outline-text-2" id="text-orge37edd7">
<p>
This is an interesting technique. <a href="https://www.mathworks.com/help/stats/understanding-support-vector-machine-regression.html">It draws on the idea of SVM</a>.
</p>
</div>
</div>
